# IFCHybrid Import Import Elements Method

Source: https://www.revitapidocs.com/2026/38d36ad5-886f-e863-b1d8-649db7ea9293.htm

---

| IFCHybrid Import Import Elements Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ImportElements(Document, String) | **Obsolete.** Imports IFC Elements using AnyCAD. |
|  | ImportElements(Document, String, IFCHybridImportOptions) | Imports IFC Elements using AnyCAD. |

Top See Also

#### Reference

IFCHybridImport Class Autodesk.Revit.DB.IFC Namespace